NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/ZGM23/ZGM230SB27HGN.svd
        <register>
          <name>DIGIGAINCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>DIGIGAINEN</name>
              <description>Digital Gain Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGIGAINSEL</name>
              <description>Digital Gain Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAINM3</name>
                  <description>GAINM3 </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P75</name>
                  <description>GAINM2P75</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P5</name>
                  <description>GAINM2P5 </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P25</name>
                  <description>GAINM2P25</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2</name>
                  <description>GAINM2 </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P75</name>
                  <description>GAINM1P75</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P5</name>
                  <description>GAINM1P5 </description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P25</name>
                  <description>GAINM1P25</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1</name>
                  <description>GAINM1 </description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P75</name>
                  <description>GAINM0P75</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P5</name>
                  <description>GAINM0P5 </description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P25</name>
                  <description>GAINM0P25</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0</name>
                  <description>GAINM0 </description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P25</name>
                  <description>GAINP0P25</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P5</name>
                  <description>GAINP0P5 </description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P75</name>
                  <description>GAINP0P75</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1</name>
                  <description>GAINP1 </description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P25</name>
                  <description>GAINP1P25</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P5</name>
                  <description>GAINP1P5 </description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P75</name>
                  <description>GAINP1P75</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2</name>
                  <description>GAINP2 </description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P25</name>
                  <description>GAINP2P25</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P5</name>
                  <description>GAINP2P5 </description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P75</name>
                  <description>GAINP2P75</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP3</name>
                  <description>GAINP3 </description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGIGAINDOUBLE</name>
              <description>Digital Gain Doubled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGIGAINHALF</name>
              <description>Digital Gain Halved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC0GAIN</name>
              <description>DEC0 Gain Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>POSTPONESEL</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVANCESEL</name>
              <description></description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEWWNDSEL</name>
              <description></description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEAKSEL</name>
              <description></description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSENTSEL</name>
              <description></description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENTSEL</name>
              <description></description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWCORRSEL</name>
              <description></description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT0SEL</name>
              <description></description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT1SEL</name>
              <description></description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFADCCLKSEL</name>
              <description></description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REALTIMCFE</name>
          <description>No Description</description>
          <addressOffset>0x1B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x001F81F4</resetValue>
          <resetMask>0xE03FFFFF</resetMask>
          <fields>
            <field>
              <name>MINCOSTTHD</name>
              <description>Minimum Cost Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTSCHWIN</name>
              <description>Real time CFE searching window</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTSCHMODE</name>
              <description>Real Time CFE searching mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKINGWIN</name>
              <description>Correlator size for Tracking </description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCACQWIN</name>
              <description>SYNC Correlator Size  </description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTENSCHBYP</name>
              <description>Bypass extending Search Time</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINEWEN</name>
              <description>Enable SINE WEIGHT</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTAFCFRAME</name>
              <description>Viterbi AFC FRAME Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCFEEN</name>
              <description>TRECS Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFF7FF</resetMask>
          <fields>
            <field>
              <name>ETSLOC</name>
              <description>Early Time Stamp Location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPSIGONPRS</name>
              <description>Capture Signal On PRS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTRIG</name>
              <description>Trigger to capture</description>
              <bitOffset>12</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETSTIM</name>
          <description>No Description</description>
          <addressOffset>0x1BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>ETSTIMVAL</name>
              <description>ETSTIMVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETSCOUNTEREN</name>
              <description>ETSCOUNTEREN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x003C0000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>ANTDFLTSEL</name>
              <description>Ant Default Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTCOUNT</name>
              <description>Total Ant count</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTSWTYPE</name>
              <description>Ant Switch Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>US_2</name>
                  <description>2us ant switching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>US_4</name>
                  <description>4us ant switching</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>US_6</name>
                  <description>6us ant switching</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>US_8</name>
                  <description>8us ant switching</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTSWRST</name>
              <description>Ant SW rst pulse</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CFGANTPATTEN</name>
              <description>Configure Ant Pattern Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTSWENABLE</name>
              <description>Ant sw enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTDSTOPPULSECNT</name>
              <description>Extend Stop Pulse Counter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWCTRL1</name>
          <description>No Description</description>
          <addressOffset>0x1C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x0006AAAA</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMEPERIOD</name>
              <description>Time Period of xtal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWSTART</name>
          <description>No Description</description>
          <addressOffset>0x1C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>ANTSWSTARTTIM</name>
              <description>Ant switch start time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTSWEND</name>
          <description>No Description</description>
          <addressOffset>0x1CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>ANTSWENDTIM</name>
              <description>Ant switch start time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRECPMPATT</name>
          <description>No Description</description>
          <addressOffset>0x1D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMEXPECTPATT</name>
              <description>Expected PM pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRECPMDET</name>
          <description>No Description</description>
          <addressOffset>0x1D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <resetMask>0xBEFFC3FF</resetMask>
          <fields>
            <field>
              <name>PMACQUINGWIN</name>
              <description>PM Correlator Size  </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMCOSTVALTHD</name>
              <description>Min COST Validation for AFC </description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIMEOUTSEL</name>
              <description>PM searching timeout Threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHSCALE</name>
              <description>PHASE Scaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMMINCOSTTHD</name>
              <description>Min. Cost thrshold for TRECS PM</description>
              <bitOffset>14</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COSTHYST</name>
              <description>PM Seaching COST HYST</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMSCH</name>
              <description>PM detection enable in TRECS </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRECSCFG</name>
          <description>No Description</description>
          <addressOffset>0x1D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00020004</resetValue>
          <resetMask>0x01FF5FFF</resetMask>
          <fields>
            <field>
              <name>TRECSOSR</name>
              <description>TRECS OSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIMLOSSTHD</name>
              <description>Timing Loss Threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIMLOSSEN</name>
              <description>ENABLE TIMING LOSS DETECTION</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMOFFSET</name>
              <description>PM SCH ADRESS offsrt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGANTPATT</name>
          <description>No Description</description>
          <addressOffset>0x1DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFGANTPATTVAL</name>
              <description>CFGANTPATTVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
